import React, { memo } from 'react'
import Typography from '@mui/material/Typography';
import storms from '../assets/storms.png';
import '../css/About.css';
import { Container } from '@mui/material';

const About = () => {
  return (
    <section id='about-section' className='about-section'>
      <div className="container">
        <div className="wrapper">
          <h1></h1>
          <Typography mb={4} fontWeight={500} variant="h4" gutterBottom>
            Геомагнит бўронлари
          </Typography>
          <div className="img">
            <img src={storms} alt="stroms" />
          </div>

          <Typography variant="body1" gutterBottom>
            <span>Геомагнит бўрон</span> - қуёш шамолининг зарба тўлқини натижасида ер геомагнитосферасининг вақтинчалик бузилиши.
            Геомагнитосфера - бу ерни ўраб турган ва қуёшдан келадиган зарарли нурланишнинг кўп қисмини қайтарадиган ҳимоя қобиқ. 
            Бироқ, қуёш шамоли зарба тўлқини геомагнитосферага тушганда, у геомагнит бўронга олиб келиши мумкин.
          </Typography>

          <Typography variant="body1" gutterBottom>
            Коронал массанинг чиқарилиши (CМЕс) туфайли юзага келади, бу қуёшдан катта миқдордаги плазма отилишидир. 
            Бу отилишлар сониясига 2000 километр тезликда ҳаракатланиши ва бир неча кун ичида ерга етиб бориши мумкин.
            CМЕ ернинг геомагнитосферасига тушганда, у геомагнитосферанинг сиқилишига ва кейин кенгайишига олиб келиши мумкин. 
            геомагнитосферанинг бундай кенгайиши ва қисқариши бир қатор оқибатларга олиб келиши мумкин, жумладан:
          </Typography>          

          <ul>
            <li>
              Ауроралар: Ауроралар - бу қуёшдан зарядланган заррачаларнинг ер атмосфераси билан ўзаро таъсиридан келиб чиқадиган ранг-баранг ёруғлик.
              Ауроралар кўпинча қутблар яқинида кўринади, аммо улар кучли геомагнит бўронлар пайтида пастроқ кенгликларда ҳам кўриш мумкин.
            </li>
            <li>
              Электр узилишлари: геомагнит бўронлар электр тармоқларида оқимларни келтириб чиқариши мумкин, бу эса трансформаторларнинг ҳаддан ташқари
              қизиши ва ишдан чиқишига олиб келиши мумкин. Бу кенг тарқалган электр узилишларига олиб келиши мумкин.
            </li>
            <li>
              Сунъий ёълдош алоқасининг бузилиши: геомагнит бўронлар сунъий ёълдош алоқаларини ҳам бузиши мумкин. Бунинг сабаби шундаки, 
              қуёшдан зарядланган зарралар сунъий ёълдошлар билан алоқа қилиш учун ишлатиладиган радио сигналларга xалақит бериши мумкин.
            </li>
            <li>
              Навигатсия муаммолари: геомагнит бўронлар ГПС каби навигатсия тизимларига ҳам xалақит бериши мумкин. Бунинг сабаби шундаки,
              қуёшдан зарядланган зарралар ернинг геомагнит майдонини бузиши мумкин, бу тизимлар ўзларининг жойлашишини аниқлаш учун фойдаланадилар.
            </li>
          </ul>

          <Typography variant="body1" gutterBottom>
            Геомагнит бўронлари бир вақтда ер юзининг йирик майдонларида кузатилади ва кўпчилик буни ҳис қилади. 
            Айниқса юрак-қон томир, асаб соҳасининг сурункаликасалликларига эга инсонлар бу жараёнларни оғир ўтказишади.
          </Typography>

          <Typography variant="body1" gutterBottom>
            Бунда асосан геомагнит бўронлари таъсирида қон айланиши ўзгариши асосий таъсир воситаси ҳисобланади. Чунки эритроцитлар
            таркибидаги темир моддаси геомагнитдан таъсирланади. Натижада томирларда тиқилмалар ҳосил бўлади ва бу айниқса сурункали
            касалликлари бор одамлар учун хавфли ҳисобланади.
          </Typography>

          <Typography variant="body1" gutterBottom>
            Асаб тизимига эса геомагнит бўрони пайтида гормонлар ишлаб чиқарилиши кучайиши таъсир қилади ва ҳолсизлик, жиззакилик,
            реакция сусайиши ёки кучайиши каби белгилар пайдо бўлади.
          </Typography>

          <Typography variant="body1" gutterBottom>
            Геомагнит бўронлари вақти-вақти билан албатта содир бўлувчи ҳодиса экан, бу жараёндан инсон ўзини ҳимоялаши шарт:
          </Typography>

          <ul>
            <li>
              Бундай кунлар одатда ОАВ орқали эълон қилинади. Асабийлашишдан тийилиш, ҳазми оғир овқатлар истеъмол қилмаслик,
              спиртли ичимликлар, чекишни чеклаш лозим;
            </li>
            <li>
              Шундай кунларда жисмоний меҳнатни чеклаб туриш, ақлий меҳнатда ҳам организмни зўриқтирмаслик мақсадга мувофиқ;
            </li>
            <li>
              Имкон қадар душ қабул қилиб туриш, илиқ сув ичиш ва салқин хоналарда ўтириш керак;
            </li>
            <li>
              Сурункали касалликлари бор беморлар, айниқса юрак-қон томир касалликлари, жумладан инсульт ўтказганлар ёлғиз қолмасликлари, бир ўзлари автомобиль бошқармасликлари, ҳар бир дори воситасини шифокор назоратида қабул қилишлари даркор;
            </li>
            <li>
              Умуман, геомагнит бўронларига табиатнинг бир ҳодисаси сифатида қараш ва қўрқмаслик лозим. Шунда ўтказиб юбориш осон кечади.
            </li>
          </ul>
        </div>
      </div>
    </section>
  )
}
export default memo(About);
